package ru.piteravto.osmroutetest.map

object BusStopsTestData {
    fun getTestData(): List<BusStop> {
        return testData()
    }

    private fun testData(): List<BusStop> {
        return listOf(
            BusStop("Крестовский Остров", 59.9688418871931, 30.2478097766124, 'A'),
            BusStop("Рюхина улица", 59.9694711465851, 30.2593405888063, 'A'),
            BusStop("Станция метро Крестовский Остров", 59.9710777118983, 30.2597690444382, 'A'),
            BusStop("Спортивная улица", 59.9705037992726, 30.2683274456856, 'A'),
            BusStop("Крестовский проспект", 59.9696469592718, 30.2683274456856, 'A'),
            BusStop("КП БПМ", 59.9652812510306, 30.2546739578247, 'A'),
            BusStop("Петровская площадь", 59.961645142229, 30.2526352581668, 'A'),
            BusStop("Дом ветеранов сцены", 59.9615594362352, 30.2556130248086, 'A'),
            BusStop("Петровский проспект, 9", 59.9604880925422, 30.2622969326664, 'A'),
            BusStop("Ремесленная улица", 59.9595827800258, 30.2675883597206, 'A'),
            BusStop("Улица Красного Курсанта", 59.9616558554626, 30.2755790572557, 'A'),
            BusStop("Корпусная улица", 59.960964844778, 30.2790388364834, 'A'),
            BusStop("Большая Разночинная улица", 59.9624486251024, 30.2856691873872, 'A'),
            BusStop("Станция метро Чкаловская", 59.9610773358748, 30.2924173635898, 'A'),
            BusStop("Большой проспект П.С.", 59.9574613588049, 30.2993476334359, 'A'),
            BusStop("Сытный рынок", 59.9586399429744, 30.3119013834508, 'A'),
            BusStop("Австрийская площадь", 59.960075615953, 30.3181568356767, 'A'),
            BusStop("Малая Монетная улица", 59.9612648201847, 30.324026677834, 'A'),
            BusStop("Большая Монетная улица", 59.963568111973, 30.3289324948193, 'A'),
            BusStop("Улица Рентгена", 59.9658712430932, 30.3312675780132, 'A'),
            BusStop("Большой Сампсониевский проспект", 59.9687418978668, 30.340543642444, 'A'),
            BusStop("Станция метро Выборгская", 59.971390903104, 30.3473560869913, 'A'),
            BusStop("Станция метро Выборгская", 59.971390903104, 30.3473560869913, 'B'),
            BusStop("Гренадерская улица", 59.9701056693041, 30.3473132414281, 'B'),
            BusStop("Большой Сампсониевский проспект", 59.969007825804, 30.3400723412489, 'B'),
            BusStop("Улица Рентгена", 59.9659979407503, 30.3308819679444, 'B'),
            BusStop("Большая Монетная улица", 59.9638126565318, 30.3291574340259, 'B'),
            BusStop("Малая Монетная улица", 59.9625110582306, 30.3220557819272, 'B'),
            BusStop("Каменноостровский проспект", 59.9616325842858, 30.3168072004362, 'B'),
            BusStop("Сытнинская улица", 59.958048811241, 30.3127904288871, 'B'),
            BusStop("Сытный рынок", 59.9568809207575, 30.312747583324, 'B'),
            BusStop("Введенская улица", 59.955289737442, 30.3070384120286, 'B'),
            BusStop("Большой проспект П.С.", 59.9580702400383, 30.2986835272064, 'B'),
            BusStop("Станция метро Чкаловская", 59.9609415731142, 30.2931243153823, 'B'),
            BusStop("Малая Зеленина улица", 59.9622753723931, 30.2837732712159, 'B'),
            BusStop("Новоладожская улица", 59.9627788810038, 30.2752255813593, 'B'),
            BusStop("Ремесленная улица", 59.9597148587466, 30.2684345595936, 'B'),
            BusStop("Петровский проспект, 9", 59.9607326599131, 30.2619006112069, 'B'),
            BusStop("Дом ветеранов сцены", 59.9618682747114, 30.2552381261307, 'B'),
            BusStop("КП БПМ", 59.965047058301, 30.2555751800537, 'B'),
            BusStop("Медицинское учреждение", 59.9688792953968, 30.2596940647025, 'B'),
            BusStop("Спортивная улица", 59.9710695993456, 30.2675455141572, 'B'),
            BusStop("Cтанция метро Крестовский остров", 59.9713480627835, 30.2598333127829, 'B'),
            BusStop("Крестовский Остров", 59.9688418871931, 30.2478097766124, 'B')
        )
    }
}